WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/meadow_timer_support.c
static int meadow_timer_isr_pulse_width(int irq, void *context, void *arg);
static int meadow_timer_init_gated_pulse_width(struct timerInfo_s *timerInfo);
static int meadow_timer_test_gated_pulse_width(struct timerInfo_s *timerInfo);

static int meadow_timer_isr_freq_dutycycle(int irq, void *context, void *arg);
static int meadow_timer_init_freq_and_dutycycle(struct timerInfo_s *timerInfo);
static int meadow_timer_test_freq_and_dutycycle(struct timerInfo_s *timerInfo);

static int meadow_timer_isr_idle_measure(int irq, void *context, void *arg);
static int meadow_timer_init_idle_measure(struct timerInfo_s *timerInfo);
static int meadow_timer_test_idle_measure(struct timerInfo_s *timerInfo);

/****************************************************************************
 * Private Data
 ****************************************************************************/
// This is the beginning of a list of Meadow Timer Configuration (mtc) settings.
// These will eventually be set, directly or indirectly. by the .Net programmer.

// Filter out the 6us glitch from HC-SR04 when it finds no target.
static bool mtcHC_SR04Filter = true;

static bool mtcIncludeIdleMeasure = false;

// For now, select max of one mode of execution
static bool mtcPulseWidth = false;
static bool mtcFreqDutyCycle = true;

// In many cases only channels 1 or 2 will work.
static int mtcActiveChannel = 1;

// The following are all diagnostic and not production stuff
static uint32_t _idleRatio;


static int debugCount = 0;  // DEBUG

/****************************************************************************
 * Private Types
 ****************************************************************************/

/****************************************************************************
 * Private Functions
 ****************************************************************************/

// uint16_t getreg16(unsigned int addr);
// void modifyreg16(unsigned int addr, uint16_t clearbits, uint16_t setbits);
// void putreg16(regval, unsigned int addr);
// stm32_gpiowrite(pin_set, t/f);
// t/f = stm32_gpioread(pin_set);

//============================================================================
// This function is called for interrupts configured for measuring idle time
int meadow_timer_isr_idle_measure(int irq, void *context, void *arg)
{
  if(! mtcIncludeIdleMeasure)
    return OK;

  // Check the timer's Status Register
  struct timerInfo_s *timerInfo = (struct timerInfo_s *)arg;
  uint32_t timerBase = timerInfo->timerBase;
  uint16_t timStatusReg = getreg16(timerBase + STM32_GTIM_SR_OFFSET);

  // Since only counting up, UIF means overflow
  if(timStatusReg & GTIM_SR_UIF)
  {
    timStatusReg &= ~GTIM_SR_UIF;
    putreg16(timStatusReg, timerBase + STM32_GTIM_SR_OFFSET);

    // For the dile counter we keep the overflow in the upper 16-bits. This
    // makes adding the current count very fast.
    timerInfo->timerExtra1 += MEADOW_TIMER_16_BIT_OVERFLOW;
  }

  return OK;
}

//============================================================================
// This function is called for all frequency with duty cycle interrupts.
// On the first rising edge of the input, the timer clears the CNT count and
// CNT begins counting up.
// On the following falling edge, the timer copies the CNT value into CCR2.
// On the next rising edge, the timer copies the CNT value into CCR1 and CNT
// is again cleared to zero and the process repeats.
// This means that we must read CCR1 and CCR2 between the rising edge and the
// falling edge.
// This is made more complex because for 16-bit timers, we must maintain a
// count of all CNT overflow interupts. For CCR1 overflow for the entire period
// but for CCR2 only between the rising edge and the falling edge.
// Note: a 16-bit register at 96MHz will overflow every 683 microseconds.
int meadow_timer_isr_freq_dutycycle(int irq, void *context, void *arg)
{
  if(!mtcFreqDutyCycle)
    return OK;
  
  debugCount++;    // DEBUG CODE

  // Why are we here? Check the timer's Status Register
  struct timerInfo_s *timerInfo = (struct timerInfo_s *)arg;
  uint32_t timerBase = timerInfo->timerBase;
  uint16_t timStatusReg = getreg16(timerBase + STM32_GTIM_SR_OFFSET);

  timerInfo->timerStartEdge = 0;
  
  //--------------------------------------------
  // Capture/Compare 1 signifies that input rising edge encountered.
  if(timStatusReg & GTIM_SR_CC1IF)
  {
    // Clear this interrupt bit
    timStatusReg &= ~GTIM_SR_CC1IF;
    putreg16(timStatusReg, timerBase + STM32_GTIM_SR_OFFSET);

    // Grab the current CCR1 value and, if it's a 16-bit register, add the
    // overflow totals.
    if(timerInfo->timerWidth == 16)
    {
      timerInfo->timerCount1 = (uint32_t)getreg16(timerBase + STM32_GTIM_CCR1_OFFSET);
      timerInfo->timerCount1 += timerInfo->timerExtra1 + MEADOW_TIMER_CORRECTION_COUNT;
      timerInfo->timerExtra1 = 0;      // Reset CNT overflow counts
    }
    else
    {
      timerInfo->timerCount1 = (uint32_t)getreg32(timerBase + STM32_GTIM_CCR1_OFFSET)\
                + MEADOW_TIMER_CORRECTION_COUNT;
    }
    
    timerInfo->timerStartEdge = 1;

    // Collect CNT overflow for CCR2 until falling edge
    timerInfo->timerColCC2 = 1;
  }

  //---------------------------------------------------
  // Capture/Compare 2 interrupt signifies an input falling edge. This
  // signifies that the timer has copied CNT into CCR2.
  if(timStatusReg & GTIM_SR_CC2IF)
  {
    timStatusReg &= ~GTIM_SR_CC2IF;
    putreg16(timStatusReg, timerBase + STM32_GTIM_SR_OFFSET);

    timerInfo->timerColCC2 = 0;

    // Falling edge means we're done considering CCR2's value so we don't 
    // need to worry about CNT overflow with respect to CCR2.
    if(timerInfo->timerWidth == 16)
    {
      timerInfo->timerCount2 = (uint32_t)getreg16(timerBase + STM32_GTIM_CCR2_OFFSET);
      timerInfo->timerCount2 += timerInfo->timerExtra2 + MEADOW_TIMER_CORRECTION_COUNT;
      timerInfo->timerExtra2 = 0;
    }
    else
    {
      timerInfo->timerCount2 = (uint32_t)getreg32(timerBase + STM32_GTIM_CCR2_OFFSET) \
                + MEADOW_TIMER_CORRECTION_COUNT;
    }
  }

